Aerofoil-Rigid/AeroFoil3D_10deg/simpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (20.01145 0 0);//(25.75 3.62 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
	value 		uniform (20.01145 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    aerofoil
    {
        type            noSlip;
    }

    front
    {
        type            empty;
    }

    bottom
    {
        type            symmetryPlane;
    }
 
    top
    {
        type            symmetryPlane;
    }
  
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
